Revit 2027 API
ParameterTypeId.WallSweepPlacementHorizontal Property
 "Horizontal"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId WallSweepPlacementHorizontal { get; }
Public Shared ReadOnly Property WallSweepPlacementHorizontal As ForgeTypeId
	Get
public:
static property ForgeTypeId^ WallSweepPlacementHorizontal {
	ForgeTypeId^ get ();
}
static member WallSweepPlacementHorizontal : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace